verification/runs/F14-cooling-ladder/K0cP_runs/P021_sq_f/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0.orig";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 303.150000000;

boundaryField
{
    hotWall    { type fixedValue; value uniform 323.150000000; }
    coldWall   { type fixedValue; value uniform 283.150000000; }
    topWall
    {
        type            uniformFixedValue;
        uniformValue
        {
            type        expression;
            expression  #{ 323.150000 + (-1360.000000)*(pos().x() - 0.00000000) + (1180.699500)*max(0.0, pos().x() - 0.00150000) + (186.540319)*max(0.0, pos().x() - 0.00500250) + (-70.523401)*max(0.0, pos().x() - 0.00997500) + (-17.117420)*max(0.0, pos().x() - 0.02002500) + (15.076234)*max(0.0, pos().x() - 0.03997500) + (32.631435)*max(0.0, pos().x() - 0.07500000) + (6.560000)*max(0.0, pos().x() - 0.15000000) + (8.640000)*max(0.0, pos().x() - 0.22500000) + (-3.093333)*max(0.0, pos().x() - 0.30000000) + (6.826667)*max(0.0, pos().x() - 0.37500000) + (-15.946667)*max(0.0, pos().x() - 0.45000000) + (-7.520000)*max(0.0, pos().x() - 0.52500000) + (-43.200000)*max(0.0, pos().x() - 0.60000000) + (-37.660414)*max(0.0, pos().x() - 0.67500000) + (-68.178584)*max(0.0, pos().x() - 0.71002500) + (156.414918)*max(0.0, pos().x() - 0.72997500) + (-50.957335)*max(0.0, pos().x() - 0.74002500) + (-222.170643)*max(0.0, pos().x() - 0.74497500) + (-2275.687943)*max(0.0, pos().x() - 0.74850000) #};
        }
        value           uniform 303.150000000;
    }
    bottomWall
    {
        type            uniformFixedValue;
        uniformValue
        {
            type        expression;
            expression  #{ 323.150000 + (-2176.000000)*(pos().x() - 0.00000000) + (2009.261956)*max(0.0, pos().x() - 0.00150000) + (25.159361)*max(0.0, pos().x() - 0.00500250) + (52.822464)*max(0.0, pos().x() - 0.00997500) + (-92.897916)*max(0.0, pos().x() - 0.02002500) + (53.174478)*max(0.0, pos().x() - 0.03997500) + (56.746324)*max(0.0, pos().x() - 0.07500000) + (32.106667)*max(0.0, pos().x() - 0.15000000) + (9.760000)*max(0.0, pos().x() - 0.22500000) + (5.493333)*max(0.0, pos().x() - 0.30000000) + (3.733333)*max(0.0, pos().x() - 0.37500000) + (-0.373333)*max(0.0, pos().x() - 0.45000000) + (-6.080000)*max(0.0, pos().x() - 0.52500000) + (-11.520000)*max(0.0, pos().x() - 0.60000000) + (-24.427352)*max(0.0, pos().x() - 0.67500000) + (-35.806433)*max(0.0, pos().x() - 0.71002500) + (61.832192)*max(0.0, pos().x() - 0.72997500) + (-27.631539)*max(0.0, pos().x() - 0.74002500) + (-34.076940)*max(0.0, pos().x() - 0.74497500) + (-394.609929)*max(0.0, pos().x() - 0.74850000) #};
        }
        value           uniform 303.150000000;
    }
    frontAndBack { type empty; }
}

// ******************************************************** //
